## PAIR PROGRAMMING ETL IV

### ETL Carga I - Creación BBDD e inserción de datos
---

Es el momento de meter todos nuestros datos en SQL 💪🏽!!! En este ejercicio nos crearemos dos tablas en una BBDD creada por nosotras. Una de las tablas contendrá la información que obtuvimos de los ejercicios de pair programming de Limpieza, es decir, el data set de ataques de tiburones limpito. La segunda tabla tendrá la información obtenida en el ejercicio de pair de ETL 1.

📌 Nota Todo lo tendremos que hacer desde jupyter notebook

**EJERCICIO 1**

Cread la BBDD con el nombre de tiburones.

In [2]:
import pandas as pd
import mysql.connector

In [3]:
def crear_bbdd(nombre_bbdd):

    mydb = mysql.connector.connect(
      host="localhost",
      user="root",
      password="AlumnaAdalab")
      
    print("Conexión realizada con éxito")
    
    mycursor = mydb.cursor()

    try:
        mycursor.execute(f"CREATE DATABASE IF NOT EXISTS {nombre_bbdd};")
        print(mycursor)
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [4]:
mydb = crear_bbdd("tiburones")

Conexión realizada con éxito
MySQLCursor: CREATE DATABASE IF NOT EXISTS tiburones;

---

**EJERCICIO 2**

Cread las tablas de la BBDD:
- Tabla ataques
- Tabla clima

In [5]:
def crear_insertar_tabla(nombre_bbdd, contraseña, query):
    
   
    cnx = mysql.connector.connect(user='root', password=f"{contraseña}",
                                     host='127.0.0.1', database=f"{nombre_bbdd}")
   
    mycursor = cnx.cursor()
    
    
    try: 
        mycursor.execute(query)
        cnx.commit() 
   
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [6]:
df_attacks= pd.read_pickle('../files/attacks12.pickle')
df_attacks.head(2)

,case_number,type,country,activity,age,species_,date,mes_ataque,fatal,sexo,cat_species,mes,year,edades
0,1800.00.00,Unprovoked,seychelles,a corsair's boat was overturned,NaN,NaN,1800,NaN,Y,F,NaN,NaN,1997.0,27.878808
1,1797.05.28.R,Unprovoked,NaN,Dropped overboard,NaN,NaN,Reported May-28-1797,May,Y,M,NaN,May,1997.0,27.878808

In [7]:
df_attacks.columns #Verificamos los nombres de las columnas para crear la tabla

Index(['case_number', 'type', 'country', 'activity', 'age', 'species_', 'date',
       'mes_ataque', 'fatal', 'sexo', 'cat_species', 'mes', 'year', 'edades'],
      dtype='object')

In [8]:
df_attacks.dtypes # Verificamos los tipos de datos.

case_number     object
type            object
country         object
activity        object
age             object
species_        object
date            object
mes_ataque      object
fatal           object
sexo            object
cat_species     object
mes             object
year           float64
edades         float64
dtype: object

In [9]:
df_attacks.isnull().sum() # Chequeamos si la columna tiene nulos.

case_number      0
type             0
country         10
activity        31
age            154
species_       126
date             0
mes_ataque     141
fatal           97
sexo             0
cat_species    126
mes            170
year             0
edades           0
dtype: int64

In [10]:
query_attacks= '''
CREATE TABLE IF NOT EXISTS `tiburones`.`ataques` (
`id_ataque` INT NOT NULL AUTO_INCREMENT,
`case_number` VARCHAR(45),
`type` VARCHAR(45),
`country` VARCHAR(45),
`activity` VARCHAR(100), 
`age` VARCHAR(45),
`species_` VARCHAR(100),
`date` VARCHAR(45),
`mes_ataque` VARCHAR(45), 
`fatal` VARCHAR(45), 
`sexo` VARCHAR(45), 
`cat_species` VARCHAR(45), 
`mes` VARCHAR(45),
`year` FLOAT , 
`edades` FLOAT,
PRIMARY KEY (`id_ataque`,`country`),
KEY idx_country (`country`))
ENGINE = InnoDB;
'''

In [11]:
df_clima = pd.read_csv('../files/datos_clima_paises_2.csv', index_col=0)
df_clima.head(2)

,country,speed950mb,speed900mb,speed850mb,speed800mb,speed750mb,speed700mb,speed650mb,speed600mb,speed550mb,...,temp2m,rh2m,weather,wind10m.direction,wind10m.speed,highcloud,midcloud,lowcloud,msl_pressure,snow_depth
0,australia,3.656250,3.515625,3.4375,3.328125,3.375000,3.359375,3.250000,3.375000,3.578125,...,25.9375,10.859375,NaN,117.578125,3.234375,-9999.0,-9999.0,-9999.0,1015.0625,0.0
1,new zealand,3.734375,3.640625,3.5625,3.703125,3.671875,3.687500,3.734375,3.859375,3.968750,...,15.1875,11.156250,NaN,166.093750,3.390625,-9999.0,-9999.0,-9999.0,1015.8750,0.0

In [12]:
df_clima.columns

Index(['country', 'speed950mb', 'speed900mb', 'speed850mb', 'speed800mb',
       'speed750mb', 'speed700mb', 'speed650mb', 'speed600mb', 'speed550mb',
       'speed500mb', 'speed450mb', 'speed400mb', 'speed350mb', 'speed300mb',
       'speed250mb', 'speed200mb', 'direction200mb', 'direction250mb',
       'direction300mb', 'direction350mb', 'direction400mb', 'direction450mb',
       'direction500mb', 'direction550mb', 'direction600mb', 'direction650mb',
       'direction700mb', 'direction750mb', 'direction800mb', 'direction850mb',
       'direction900mb', 'direction950mb', 'rh_950mb', 'rh_900mb', 'rh_850mb',
       'rh_800mb', 'rh_750mb', 'rh_700mb', 'rh_650mb', 'rh_600mb', 'rh_550mb',
       'rh_500mb', 'rh_450mb', 'rh_400mb', 'rh_350mb', 'rh_300mb', 'rh_250mb',
       'rh_200mb', 'timepoint', 'cloudcover', 'lifted_index', 'prec_amount',
       'temp2m', 'rh2m', 'weather', 'wind10m.direction', 'wind10m.speed',
       'highcloud', 'midcloud', 'lowcloud', 'msl_pressure', 'snow_depth'],
      dtype='object')

In [13]:
df_clima.isnull().sum()

country         0
speed950mb      0
speed900mb      0
speed850mb      0
speed800mb      0
               ..
highcloud       0
midcloud        0
lowcloud        0
msl_pressure    0
snow_depth      0
Length: 63, dtype: int64

In [14]:
df_clima.dtypes

country          object
speed950mb      float64
speed900mb      float64
speed850mb      float64
speed800mb      float64
                 ...
highcloud       float64
midcloud        float64
lowcloud        float64
msl_pressure    float64
snow_depth      float64
Length: 63, dtype: object

In [15]:
query_clima= '''CREATE TABLE IF NOT EXISTS `tiburones`.`clima` (
`id_clima` INT NOT NULL AUTO_INCREMENT,
`country` VARCHAR(45) NOT NULL,
`speed950mb` FLOAT NOT NULL,
`speed900mb` FLOAT NOT NULL,
`speed850mb` FLOAT NOT NULL,
`speed800mb` FLOAT NOT NULL,
`speed750mb` FLOAT NOT NULL,
`speed700mb` FLOAT NOT NULL,
`speed650mb` FLOAT NOT NULL,
`speed600mb` FLOAT NOT NULL,
`speed550mb` FLOAT NOT NULL,
`speed500mb` FLOAT NOT NULL,
`speed450mb` FLOAT NOT NULL,
`speed400mb` FLOAT NOT NULL,
`speed350mb` FLOAT NOT NULL,
`speed300mb` FLOAT NOT NULL,
`speed250mb` FLOAT NOT NULL,
`speed200mb` FLOAT NOT NULL,
`direction950mb` FLOAT NOT NULL,
`direction900mb` FLOAT NOT NULL,
`direction850mb` FLOAT NOT NULL,
`direction800mb` FLOAT NOT NULL,
`direction750mb` FLOAT NOT NULL,
`direction700mb` FLOAT NOT NULL,
`direction650mb` FLOAT NOT NULL,
`direction600mb` FLOAT NOT NULL,
`direction550mb` FLOAT NOT NULL,
`direction500mb` FLOAT NOT NULL,
`direction450mb` FLOAT NOT NULL,
`direction400mb` FLOAT NOT NULL,
`direction350mb` FLOAT NOT NULL,
`direction300mb` FLOAT NOT NULL,
`direction250mb` FLOAT NOT NULL,
`direction200mb` FLOAT NOT NULL,
`rh_950mb` FLOAT NOT NULL,
`rh_900mb` FLOAT NOT NULL,
`rh_850mb` FLOAT NOT NULL,
`rh_800mb` FLOAT NOT NULL,
`rh_750mb` FLOAT NOT NULL,
`rh_700mb` FLOAT NOT NULL,
`rh_650mb` FLOAT NOT NULL,
`rh_600mb` FLOAT NOT NULL,
`rh_550mb` FLOAT NOT NULL,
`rh_500mb` FLOAT NOT NULL,
`rh_450mb` FLOAT NOT NULL,
`rh_400mb` FLOAT NOT NULL,
`rh_350mb` FLOAT NOT NULL,
`rh_300mb` FLOAT NOT NULL,
`rh_250mb` FLOAT NOT NULL,
`rh_200mb` FLOAT NOT NULL,
`timepoint` FLOAT NOT NULL, 
`cloudcover` FLOAT NOT NULL, 
`lifted_index` FLOAT NOT NULL, 
`prec_amount` FLOAT NOT NULL,
`temp2m` FLOAT NOT NULL, 
`rh2m` FLOAT NOT NULL, 
`weather` FLOAT NOT NULL, 
`wind10m.direction` FLOAT NOT NULL, 
`wind10m.speed` FLOAT NOT NULL,
`highcloud` FLOAT NOT NULL, 
`midcloud` FLOAT NOT NULL, 
`lowcloud` FLOAT NOT NULL, 
`msl_pressure` FLOAT NOT NULL, 
`snow_depth` FLOAT NOT NULL,
`fecha` DATE,
PRIMARY KEY (`id_clima`, `country`),
CONSTRAINT `fk_clima_ataques`
FOREIGN KEY (`country`)
REFERENCES `ataques` (`country`) ON DELETE RESTRICT ON UPDATE CASCADE)
ENGINE = InnoDB;'''

In [16]:
crear_insertar_tabla('tiburones',  'AlumnaAdalab', query_attacks)

In [17]:
crear_insertar_tabla('tiburones',  'AlumnaAdalab', query_clima)

---

**BONUS** 

Insertar los datos en las tablas.
📌 Nota Esta parte del pair es optativa y no será considerada para la evaluación

'case_number', 'type', 'country', 'activity', 'age', 'species_', 'date',
       'mes_ataque', 'fatal', 'sexo', 'cat_species', 'mes', 'year', 'edades'

In [24]:
for indice, fila in df_attacks.iterrows():
    
    
    query_datos_ataques = f"""
                INSERT INTO ataques (case_number, type,country,activity,age, species_, date, mes_ataque, fatal, sexo, cat_species, mes,year, edades) 
                VALUES ( "{fila["case_number"]}", "{fila['type']}", "{fila['country']}","{fila['activity']}","{fila['age']}", "{fila['species_']}", "{fila['date']}", "{fila['mes_ataque']}", "{fila['fatal']}", "{fila['sexo']}", "{fila['cat_species']}", "{fila['mes']}", "{fila['year']}","{fila['edades']}");
                """



    crear_insertar_tabla('tiburones','AlumnaAdalab', query_datos_ataques)

1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'the creature cast the man out of his throat."","nan", ""The fish was harpooned, ' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'the creature cast the man out of his throat."","nan", ""The fish was harpooned, ' at line 2
1406 (22001): Data too long for column 'activity' at row 1
Error Code: 1406
SQLSTATE 22001
Message Data too long for column 'activity' at row 1
1406 (22001): Data too long for column 'activity' at row 1
Error Code: 1406
SQLSTATE 22001
Message Data too long for column 'activity' at row 1
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'A pack of sharks"", "Before 1962", "nan", "N", "M", "Unspecified", "nan", "1997.' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'A pack of sharks"", "Before 1962", "nan", "N", "M", "Unspecified", "nan", "1997.' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'During the war" 1943-1945", "943 ", "N", "M", "nan", "nan", "1997.0","27.8788079' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'During the war" 1943-1945", "943 ", "N", "M", "nan", "nan", "1997.0","27.8788079' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Before the war"", "nan", "N", "M", "nan", "nan", "1997.0","27.87880794701987")' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Before the war"", "nan", "N", "M", "nan", "nan", "1997.0","27.87880794701987")' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a black-tipped shark"", "1940 - 1950", "nan", "Y", "M", "Unspecified", "nan", "1' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a black-tipped shark"", "1940 - 1950", "nan", "Y", "M", "Unspecified", "nan", "1' at line 2
1406 (22001): Data too long for column 'date' at row 1
Error Code: 1406
SQLSTATE 22001
Message Data too long for column 'date' at row 1
1406 (22001): Data too long for column 'species_' at row 1
Error Code: 1406
SQLSTATE 22001
Message Data too long for column 'species_' at row 1
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '8"", "02-Oct-2014", "Oct ", "N", "M", "White", "Oct", "2014.0","23.0")' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '8"", "02-Oct-2014", "Oct ", "N", "M", "White", "Oct", "2014.0","23.0")' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'to 24" shark", "31-May-2012", "May ", "N", "F", "Unspecified", "May", "2012.0","' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'to 24" shark", "31-May-2012", "May ", "N", "F", "Unspecified", "May", "2012.0","' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'to 24" shark", "03-Sep-2007", "Sep ", "N", "F", "Unspecified", "Sep", "2007.0","' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'to 24" shark", "03-Sep-2007", "Sep ", "N", "F", "Unspecified", "Sep", "2007.0","' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a small shark"", "26-Apr-2007", "Apr ", "N", "F", "Unspecified", "Apr", "2007.0"' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a small shark"", "26-Apr-2007", "Apr ", "N", "F", "Unspecified", "Apr", "2007.0"' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'to 30" shark", "07-Jan-2007", "Jan ", "nan", "M", "Unspecified", "Jan", "2007.0"' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'to 30" shark", "07-Jan-2007", "Jan ", "nan", "M", "Unspecified", "Jan", "2007.0"' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '], 140-kg [309-lb] shark at the same spot. It was believed this was the same sha' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '], 140-kg [309-lb] shark at the same spot. It was believed this was the same sha' at line 2
1406 (22001): Data too long for column 'species_' at row 1
Error Code: 1406
SQLSTATE 22001
Message Data too long for column 'species_' at row 1
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'small shark"", "28-May-2005", "May ", "N", "M", "Unspecified", "May", "2005.0","' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'small shark"", "28-May-2005", "May ", "N", "M", "Unspecified", "May", "2005.0","' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'white shark", "26-Jun-2004", "Jun ", "N", "M", "White", "Jun", "2004.0","45.0")' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'white shark", "26-Jun-2004", "Jun ", "N", "M", "White", "Jun", "2004.0","45.0")' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'grey-colored shark"", "05-Oct-2003", "Oct ", "N", "F", "Grey", "Oct", "2003.0","' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'grey-colored shark"", "05-Oct-2003", "Oct ", "N", "F", "Grey", "Oct", "2003.0","' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'sand shark"", "19-Jun-2003", "Jun ", "N", "M", "Unspecified", "Jun", "2003.0","3' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'sand shark"", "19-Jun-2003", "Jun ", "N", "M", "Unspecified", "Jun", "2003.0","3' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'to 8"] bite diameter just below left knee", "15-Apr-2003", "Apr ", "N", "M", "Un' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'to 8"] bite diameter just below left knee", "15-Apr-2003", "Apr ", "N", "M", "Un' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a small shark"", "15-Feb-2003", "Feb ", "N", "M", "Unspecified", "Feb", "2003.0"' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a small shark"", "15-Feb-2003", "Feb ", "N", "M", "Unspecified", "Feb", "2003.0"' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'whaler shark"", "16-Feb-2002", "Feb ", "N", "M", "Unspecified", "Feb", "2002.0",' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'whaler shark"", "16-Feb-2002", "Feb ", "N", "M", "Unspecified", "Feb", "2002.0",' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'small shark"", "05-Apr-2001", "Apr ", "N", "M", "Unspecified", "Apr", "2001.0","' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'small shark"", "05-Apr-2001", "Apr ", "N", "M", "Unspecified", "Apr", "2001.0","' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ']  ", "15-Aug-2000", "Aug ", "N", "M", "Tiger", "Aug", "2000.0","53.0")' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ']  ", "15-Aug-2000", "Aug ", "N", "M", "Tiger", "Aug", "2000.0","53.0")' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a small shark"", "26-Aug-1999", "Aug ", "N", "M", "Unspecified", "Aug", "1999.0"' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a small shark"", "26-Aug-1999", "Aug ", "N", "M", "Unspecified", "Aug", "1999.0"' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'small shark"", "11-Nov-1998", "Nov ", "N", "M", "Unspecified", "Nov", "1998.0","' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'small shark"", "11-Nov-1998", "Nov ", "N", "M", "Unspecified", "Nov", "1998.0","' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'juvenile shark"", "02-Aug-1997", "Aug ", "N", "M", "Unspecified", "Aug", "1997.0' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'juvenile shark"", "02-Aug-1997", "Aug ", "N", "M", "Unspecified", "Aug", "1997.0' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ']", "20-Jan-1997", "Jan ", "Y", "M", "Tiger", "Jan", "1997.0","41.0")' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ']", "20-Jan-1997", "Jan ", "Y", "M", "Tiger", "Jan", "1997.0","41.0")' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a young shark"", "06-Sep-1996", "Sep ", "N", "M", "Unspecified", "Sep", "1996.0"' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a young shark"", "06-Sep-1996", "Sep ", "N", "M", "Unspecified", "Sep", "1996.0"' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'reef shark"", "04-Feb-1996", "Feb ", "N", "M", "Unspecified", "Feb", "1996.0","7' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'reef shark"", "04-Feb-1996", "Feb ", "N", "M", "Unspecified", "Feb", "1996.0","7' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a small shark"", "26-Aug-1995", "Aug ", "N", "M", "Unspecified", "Aug", "1995.0"' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a small shark"", "26-Aug-1995", "Aug ", "N", "M", "Unspecified", "Aug", "1995.0"' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'sand" shark", "22-Aug-1995", "Aug ", "N", "M", "Unspecified", "Aug", "1995.0","2' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'sand" shark", "22-Aug-1995", "Aug ", "N", "M", "Unspecified", "Aug", "1995.0","2' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'small shark"", "22-Aug-1995", "Aug ", "N", "M", "Unspecified", "Aug", "1995.0","' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'small shark"", "22-Aug-1995", "Aug ", "N", "M", "Unspecified", "Aug", "1995.0","' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'small shark"", "19-Aug-1995", "Aug ", "N", "M", "Unspecified", "Aug", "1995.0","' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'small shark"", "19-Aug-1995", "Aug ", "N", "M", "Unspecified", "Aug", "1995.0","' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'small shark"", "08-Jul-1994", "Jul ", "N", "M", "Unspecified", "Jul", "1994.0","' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'small shark"", "08-Jul-1994", "Jul ", "N", "M", "Unspecified", "Jul", "1994.0","' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '] shark", "03-Jan-1994", "Jan ", "N", "M", "Unspecified", "Jan", "1994.0","33.0"' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '] shark", "03-Jan-1994", "Jan ", "N", "M", "Unspecified", "Jan", "1994.0","33.0"' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a small shark"", "21-Jul-1992", "Jul ", "N", "F", "Unspecified", "Jul", "1992.0"' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'a small shark"", "21-Jul-1992", "Jul ", "N", "F", "Unspecified", "Jul", "1992.0"' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '] white shark", "24-Jun-1990", "Jun ", "Y", "F", "White", "Jun", "1990.0","21.0"' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '] white shark", "24-Jun-1990", "Jun ", "Y", "F", "White", "Jun", "1990.0","21.0"' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'grey-colored" shark", "14-Feb-1988", "Feb ", "N", "M", "Grey", "Feb", "1988.0","' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'grey-colored" shark", "14-Feb-1988", "Feb ", "N", "M", "Grey", "Feb", "1988.0","' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '] white shark", "Mid Jul-1985 or mid Jul-1986", "Jul ", "N", "M", "White", "Jul"' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '] white shark", "Mid Jul-1985 or mid Jul-1986", "Jul ", "N", "M", "White", "Jul"' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '] white shark", "30-Sep-1982", "Sep ", "N", "M", "White", "Sep", "1982.0","16.0"' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '] white shark", "30-Sep-1982", "Sep ", "N", "M", "White", "Sep", "1982.0","16.0"' at line 2
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '] white shark", "31-Jan-1980", "Jan ", "N", "M", "White", "Jan", "1980.0","24.0"' at line 2
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '] white shark", "31-Jan-1980", "Jan ", "N", "M", "White", "Jan", "1980.0","24.0"' at line 2

In [23]:
df_attacks.tail()

,case_number,type,country,activity,age,species_,date,mes_ataque,fatal,sexo,cat_species,mes,year,edades
1667,1901.07.30,Unprovoked,south africa,Swimming,29,White shark,30-Jul-1901,Jul,Y,M,White,Jul,1901.0,29.0
1668,1894.11.28,Unprovoked,australia,Bathing,19,10' to 12' shark,28-Nov-1894,Nov,N,M,Unspecified,Nov,1997.0,19.0
1669,1892.03.02,Provoked,australia,Fishing,21,12' shark,02-Mar-1892,Mar,N,M,Unspecified,Mar,1997.0,21.0
1670,1880.11.25,Unprovoked,australia,Swimming,12,Bull shark,25-Nov-1880,Nov,Y,M,Bull,Nov,1997.0,12.0
1671,1868.05.13,Unprovoked,india,Standing,35,Identified as C. gangeticus by Dr. J. Fayrer,13-May-1868,May,Y,M,Unspecified,May,1997.0,35.0

In [21]:

crear_insertar_tabla('tiburones','AlumnaAdalab', query_datos_ataques)

🚨 En caso de que no tengáis los datos unidos de la sesión anterior, tenéis un csv datos_union_clima_ataques con todos los datos que necesitareis para este ejercicio